###################################################
# # 실습1
###################################################
# Location = input("방향을 입력하세요.")
# if Location == "동" :
#     print("독도")
# elif Location == "서" :
#      print("인천")
# elif Location == "남" :
#      print("제주도")
# elif Location == "북" :
# else :
#      print("방향을 다시 입력해주세요.")     

######################################################
# # 실습2
######################################################
# Num = input("정수를 입력해주세요. : ") 
# if int(Num) % 5 == 0 :
#      print("5의 배수를 입력하였습니다.")
# else :
#      print("5의 배수가 아닙니다.")

#######################################################
# # 실습3
#######################################################
# # 메일 우유의 1리터 가격 1.8 : 4200 = 1: ?
# seoul = 2500
# mail = 4200 / 1.8
# if seoul == mail :
#     print("두 우유의 가격이 같습니다.")
# elif seoul > mail :
#     print("서울 우유가", seoul -mail, "만큼 더 비쌉니다.")
# else :
#     print("메일 우유가", seoul -mail ,"만큼 더 비쌉니다.")
