#############################################################
# # 프로그램의 연산자
# . 컴퓨터가 처리해야할 명령어(연산)의 프로세스를 수학적인 키워드로 표현할 것.
#############################################################
# #대입 연산자
# ivalue = 2

# # 대입연산자 이전에 변수를 사용할 수 없다.
# print(value2)
# value2 = 10


# # 변수를 사용시 반드시 초기화 해야한다.
# # 초기화 : 데이터가 최초 1회 할당 된 상태 ( 변수의 위치 정보가 메모리에 등록된 상태)
# print(ivalues)

# # 산술 연산자.
print( 1 + 2 )
print( 2 * 1 )
print( 3 * 3 )  # 나누기 결과 (몫과 나머지를 함께 표현)
print( 5 // 2)  # 나누기 결과 (몫)
print( 5 % 2 )  # 나누기 나머지

# # 복합대입 연산자
# # 기존의 값에 새로운 값을 누적하여 연산시 사용
value = 100
value = value + 10
print(value)
